gotyuo/esp32-wsd/backups/pre-change/pre-commit-20260919-204702/net_mgr-esp8266-4oled.cpp
String NetManager::apSsidOrDefault() const {
    if (_cfg->ap_ssid[0] != '\0') return String(_cfg->ap_ssid);
    uint8_t mac[6];
    WiFi.macAddress(mac);
    String s = "ENVMON8266-" + String(mac[4], HEX) + String(mac[5], HEX);
    s.toUpperCase();
    return s;
}

// ---------- /api/data JSON ----------
void NetManager::handleDataJson() {
    String j = "{";
    j += "\"dev\":\"" + String(g_cfg.device_id) + "\",";
    j += "\"device_id\":\"" + String(g_cfg.device_id) + "\",";
    j += "\"fw\":\"" FW_VERSION "\",";
    j += "\"ssid\":\"" + String(getCurSsidForJson()) + "\",";
    j += "\"ip\":\"" + String(WiFi.localIP().toString()) + "\",";
    j += "\"rssi\":" + String(WiFi.RSSI()) + ",";
    j += "\"uptime\":" + String((unsigned)(millis() / 1000)) + ",";
    j += "\"alarm\":" + String((int)g_alarm.level()) + ",";
    j += "\"valid\":" + String(!isnan(g_last.temp_c) ? "true" : "false") + ",";
    j += "\"temp_min\":" + String(g_cfg.temp_min, 1) + ",";
    j += "\"temp_max\":" + String(g_cfg.temp_max, 1) + ",";
    j += "\"hum_min\":" + String(g_cfg.hum_min, 1) + ",";
    j += "\"hum_max\":" + String(g_cfg.hum_max, 1) + ",";
    j += "\"spo2_min\":" + String(g_cfg.spo2_min, 1) + ",";
    j += "\"hr_min\":" + String(g_cfg.hr_min, 1) + ",";
    j += "\"hr_max\":" + String(g_cfg.hr_max, 1) + ",";
    j += "\"temp_c\":" + floatOrNull(g_last.temp_c, 1) + ",";
    j += "\"hum_pct\":" + floatOrNull(g_last.hum_pct, 1) + ",";
    j += "\"pres_hpa\":" + (isnan(g_last.pres_hpa) ? "null" : String(g_last.pres_hpa, 1)) + ",";
    j += "\"sp_o2\":" + floatOrNull(g_last.sp_o2, 1) + ",";
    j += "\"pr_hr\":" + floatOrNull(g_last.pr_hr, 1) + ",";
    j += "\"temp\":" + floatOrNull(g_last.temp_c, 1) + ",";
    j += "\"hum\":" + floatOrNull(g_last.hum_pct, 1) + ",";
    j += "\"pres\":" + (isnan(g_last.pres_hpa) ? "null" : String((int)g_last.pres_hpa)) + ",";
    j += "\"spo2\":" + floatOrNull(g_last.sp_o2, 1) + ",";
    j += "\"hr\":" + floatOrNull(g_last.pr_hr, 1);
    j += "}";
    web.send(200, "application/json", j);
}

void NetManager::handleHistJson() {
    String j = "{";
    j += "\"dev\":\"" + String(g_cfg.device_id) + "\",";
    j += "\"fw\":\"" FW_VERSION "\",";
    j += "\"interval_ms\":300000,";
    j += "\"points\":" + g_hist.toJson() + "}";
    web.send(200, "application/json", j);
}

void NetManager::handleDataHtml() { web.send(200, "text/html", FPSTR(DATA_HTML)); }
void NetManager::handleHistHtml() { web.send(200, "text/html", FPSTR(HIST_HTML)); }

// ---------- 状态机入口 ----------
void NetManager::begin() {
    WiFi.setAutoReconnect(true);
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
    _ap_ssid = apSsidOrDefault();

    if (!_cfg->has_wifi()) {
        Serial.println(F("[NET] No WiFi config, entering AP config mode"));
        startAP();
    } else {
        Serial.printf("[NET] Has WiFi config (%s), trying STA first (AP fallback)\n",
                      _cfg->wifi_ssid);
        _mode = MODE_STA;
        _staStarted = true;
        _staAttemptStart = millis();
        _staAttemptTimeout = 15000;
        _retryDelay = 1000;
        WiFi.mode(WIFI_AP_STA);
        WiFi.softAP(_ap_ssid.c_str(), "", 6, 0);
        WiFi.begin(_cfg->wifi_ssid, _cfg->wifi_pass);
        startPortalServer();
        startDataService();
    }
}

void NetManager::tryReconnect() {
    uint32_t now = millis();
    if (now - _lastTry < _retryDelay) return;
    _lastTry = now;
    _retryDelay = min((uint32_t)30000, _retryDelay * 2);
    Serial.println(F("[NET] WiFi lost, reconnecting..."));
    WiFi.disconnect(true, false);
    delay(300);
    WiFi.begin(_cfg->wifi_ssid, _cfg->wifi_pass);
}

void NetManager::loop() {
    dns.processNextRequest();
    web.handleClient();

    if (_scanBusy) {
        int n = WiFi.scanComplete();
        if (n >= 0) {
            buildScanCache(n);
            WiFi.scanDelete();
            _scanBusy = false;
            Serial.printf("[NET] on-demand scan: %d\n", n);
        }
    }

    if (_mode == MODE_STA) {
        if (WiFi.status() == WL_CONNECTED) {
            if (!_staConnectedLocked) {
                WiFi.mode(WIFI_STA);
                _staConnectedLocked = true;
                _retryDelay = 1000;
                Serial.printf("[NET] STA connected: SSID=%s IP=%s (AP closed)\n",
                              WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
                startDataService();
            }
        } else {
            if (_staConnectedLocked) {
                // 之前连过, 现在断了 -> 走重连, 60s 没恢复则切 AP
                if (millis() - _lastTry > 60000) {
                    Serial.println(F("[NET] STA down >60s, dropping to AP config"));
                    _staConnectedLocked = false;
                    startAP();
                } else {
                    tryReconnect();
                }
            } else if (millis() - _staAttemptStart >= _staAttemptTimeout) {
                // 首次连接超时, 切 AP
                Serial.printf("[NET] STA connect timeout (%ds), dropping to AP\n",
                              _staAttemptTimeout / 1000);
                startAP();
            }
        }
    }
}

void NetManager::startAP() {
    _mode = MODE_AP;
    _ap_ssid = apSsidOrDefault();
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(_ap_ssid.c_str(), "", 6, 0);
    delay(300);
    dns.start(53, "*", WiFi.softAPIP());
    startPortalServer();
    startDataService();
    Serial.printf("[NET] AP started: %s (http://192.168.4.1)\n", _ap_ssid.c_str());
    _scanCache = "[]";
    delay(800);
    WiFi.scanNetworks(true, false, 0, NULL);
}

void NetManager::startPortalServer() {
    if (_portalRunning) return;
    web.on("/", HTTP_GET, [this]() { handleRoot(); });
    web.on("/scan", HTTP_GET, [this]() {
        if (web.arg("refresh") == "1") { _scanBusy = true; WiFi.scanNetworks(true, false, 0, NULL); }
        handleScan();
    });
    web.on("/save", HTTP_POST, [this]() { handleSave(); });
    web.onNotFound([this]() {
        web.sendHeader("Location", "http://192.168.4.1/");
        web.send(302, "text/plain", "");
    });
    web.begin();
    _portalRunning = true;
}

void NetManager::startDataService() {
    if (_dataServerRunning) return;
    web.on("/data", HTTP_GET, [this]() { handleDataHtml(); });
    web.on("/json", HTTP_GET, [this]() { handleDataJson(); });
    web.on("/history", HTTP_GET, [this]() { handleHistHtml(); });
    web.on("/api/data", HTTP_GET, [this]() { handleDataJson(); });
    web.on("/api/history", HTTP_GET, [this]() { handleHistJson(); });
    web.on("/config", HTTP_GET, [this]() { handleRoot(); });
    _dataServerRunning = true;
    Serial.println(F("[NET] Data routes: /data /json /history /api/data /api/history"));
}

void NetManager::handleRoot() { web.send(200, "text/html", FPSTR(PORTAL_HTML)); }

void NetManager::handleScan() {
    String json;
    json = String("{\"scanning\":") + (_scanBusy ? "true" : "false")
           + ",\"networks\":" + _scanCache + "}";
    web.send(200, "application/json", json);
}

void NetManager::buildScanCache(int n) {
    _scanCache = "[";
    for (int i = 0; i < n && i < 30; i++) {
        if (i) _scanCache += ",";
        String ssid = WiFi.SSID(i);
        _scanCache += "{\"ssid\":\"" + ssid + "\",\"rssi\":" + WiFi.RSSI(i)
                    + ",\"open\":" + (WiFi.encryptionType(i) == ENC_TYPE_NONE ? "true" : "false") + "}";
    }
    _scanCache += "]";
}

void NetManager::handleSave() {
    String ssid = web.arg("ssid2");
    ssid.trim();
    DeviceConfig c = *_cfg;
    memset(c.wifi_ssid, 0, sizeof(c.wifi_ssid));
    memset(c.wifi_pass, 0, sizeof(c.wifi_pass));
    ssid.toCharArray(c.wifi_ssid, sizeof(c.wifi_ssid));
    web.arg("pass").toCharArray(c.wifi_pass, sizeof(c.wifi_pass));
    c.server_mode = (uint8_t)web.arg("smode").toInt();
    String _h = web.arg("host");
    if (c.server_mode == 0) {
        // 自动发现模式: 清空 mqtt_host, 连上 WiFi 后用 UDP 多播找服务器
        memset(c.mqtt_host, 0, sizeof(c.mqtt_host));
    } else if (_h.length() > 0) {
        _h.toCharArray(c.mqtt_host, sizeof(c.mqtt_host));
    }
    c.mqtt_port = (uint16_t)web.arg("port").toInt();
    if (c.mqtt_port == 0) c.mqtt_port = 18830;
    web.arg("user").toCharArray(c.mqtt_user, sizeof(c.mqtt_user));
    web.arg("mpass").toCharArray(c.mqtt_pass, sizeof(c.mqtt_pass));
    String devid = web.arg("devid");
    devid.trim();
    if (devid.length() > 0) devid.toCharArray(c.device_id, sizeof(c.device_id));
    int iv = web.arg("interval").toInt();
    if (iv >= 3) c.report_interval = (uint16_t)iv;
    g_cfgStore.save(c);
    web.send(200, "text/html",
        "<meta charset='utf-8'><body style='font-family:sans-serif'>"
        "<h2>已保存！设备正在重启并连接...</h2></body>");
    Serial.println(F("[NET] Config saved, rebooting in 1.5s"));
    delay(1500);
    ESP.restart();
}

// ---------- JSON 转义 ----------
String NetManager::jsonEscape(const String &s) {
    String out;
    out.reserve(s.length() + 8);
    for (unsigned i = 0; i < s.length(); i++) {
        char c = s.charAt(i);
        switch (c) {
            case '"':  out += F("\\\""); break;
            case '\\': out += F("\\\\"); break;
            case '\n': out += F("\\n");  break;
            case '\r': out += F("\\r");  break;
            case '\t': out += F("\\t");  break;
            default:   out += c;         break;
        }
    }
    return out;
}

// =================== 局域网自动发现（UDP 多播 beacon） ===================
// 服务器端 UDP 12091 监听；ESP8266 在 LAN 发现模式下周期广播 "ENVMON?"，
// 收到服务端 JSON 应答后立即保存配置并重启，进入正常 MQTT 上报。
// 应答 JSON: {"ip":"192.168.1.100","port":18830,"user":"envmon","pass":"envmon"}
static const int DISC_PORT = 12091;
static const char DISC_REQ[] = "ENVMON?";
static const uint32_t DISC_SEND_INTERVAL = 4000;   // 每 4s 发一次
static const uint32_t DISC_TIMEOUT = 45000;        // 45s 超时回 AP

